app/views/options/_form.html.erb

    <%= f.label :instancia %><br>
    <%= f.select :instancia, options_for_select( instar() )%>
---
SELECT "instancia".* FROM "instancia"