app/controllers/inicio_controller.rb

SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "options" SET "votos" = ?, "updated_at" = ? WHERE "options"."id" = ?  [["votos", 1], ["updated_at", "2016-06-07 23:57:51.459989"], ["id", 1]]
---
  def edit

  	id_op = params[:opt]
  	votado = Option.where(id: id_op).take
  	votado.votos+=1;
  	votado.save

SELECT COUNT(*) FROM "options"
SELECT "options".* FROM "options" WHERE "options"."instancia" = ?  [["instancia", "Aventureros"]]
---
  def start
  	coso = params[:id]
    total = Option.count

    i=0
    arreglo = Array.new

    Option.where(instancia: coso).each do |opt|