app/controllers/options_controller.rb

SELECT "options".* FROM "options"
---
  def index
    @options = Option.all

SELECT "options".* FROM "options"
---
  def cerar
    Option.all.each do |op|

INSERT INTO "options" ("name", "instancia", "descripcion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "tamara delgado"], ["instancia", "Aventureros"], ["descripcion", "ella jijiji"], ["created_at", "2016-06-07 23:45:25.605404"], ["updated_at", "2016-06-07 23:45:25.605404"]]
---
  def create
    @option = Option.new(option_params)
    @option.votos=0

    respond_to do |format|
      if @option.save

UPDATE "options" SET "name" = ?, "votos" = ?, "instancia" = ?, "updated_at" = ? WHERE "options"."id" = ?  [["name", "Tamara Delgado"], ["votos", 0], ["instancia", "Conquistadores"], ["updated_at", "2016-06-08 17:59:19.729660"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @option.update(option_params)

SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_option
      @option = Option.find(params[:id])